{
    "linkbase": "https://2017.postgresopen.org/",
    "mediabase": "https://2017.postgresopen.org/",

    "conference": "PostgresOpen 2017",

    "diamond": [
	{
	    "name": "2ndQuadrant",
	    "logo": "2ndQ_logo.png",
	    "largelogo": "2ndQ_logo.png",
	    "badgelogo": "2ndQ_logo.png",
	    "link": "https://www.2ndquadrant.com/",
	    "intro": "As the Gold Standard worldwide for everything PostgreSQL, 2ndQuadrant consistently contributes enterprise features to enhance performance, scalability, security, and stability in PostgreSQL.  Spanning 22 countries and 5 continents, 2ndQuadrant is the largest single collective organization of PostgreSQL experts of any company globally.  Our PostgreSQL experts are the developers of popular tools such as:<ul><li>Postgres-BDR- Multi-master replication for geographically distributed clusters</li><li>pglogical - Fully integrated extension for logical replication</li><li>Postgres-XL - Horizontally Scalable, Massively Parallel Database with flexibility to handle OLAP & OLTP workloads</li><li>repmgr - Automatic failover management tool for configuring High Availability environments</li><li>Barman - Backup Manager and Disaster Recovery Tool for PostgreSQL</li></ul>In addition to developing these tools, our PostgreSQL experts provide 24/7 Production Support, Oracle migration services, Remote DBA support, PostgreSQL Consulting, and Training."
	},
	{
	    "name": "Citus Data",
	    "logo": "citusdata.png",
	    "largelogo": "citusdata.png",
	    "badgelogo": "citusdata.png",
	    "link": "https://www.citusdata.com/",
	    "intro": "Citus is worry-free Postgres for SaaS. Made to scale out, Citus is an extension to Postgres (not a fork) that distributes queries across any number of servers. Whether you have a multi-tenant app that needs scale, or you need to deliver real-time analytics to customers, with Citus you can focus on your app—not your database.<br><br>At Citus Data, we make it simple to shard PostgreSQL. Available as a fully-managed database as a service on AWS, as on-prem software, and as open source. Learn more at <a href=\"https://www.citusdata.com\">www.citusdata.com</a>."
	},
  {
      "name": "Microsoft",
      "logo": "microsoft.png",
      "largelogo": "microsoft.png",
      "badgelogo": "microsoft_print.png",
      "link": "https://azure.microsoft.com/en-us/services/postgresql/",
      "intro": "Microsoft's mission is to empower every person and every organization on the planet to achieve more. With its Data & AI solutions, Microsoft enables developers to easily build and deliver intelligent apps by offering productive and familiar tools to integrate data and built-in AI. To offer more choice and flexibility to developers, Microsoft has now introduced Azure Database for PostgreSQL, a PaaS offering for PostgreSQL. Learn more at <a href=\"https://www.microsoft.com/PostgreSQL\">www.microsoft.com/PostgreSQL</a>."
  }
    ],

    "platinum": [
      {
        "name": "Heroku",
  	    "logo": "heroku.svg",
  	    "largelogo": "heroku.svg",
  	    "badgelogo": "heroku.svg",
  	    "link": "https://www.heroku.com/",
  	    "intro": "Heroku, a Salesforce company and industry pioneer in platform as a service (PaaS), enables developers to build and run applications entirely in the cloud, without the need to purchase or maintain any servers or software. Over 8 million apps, including ones from Product Hunt, Casper and Citrix run on Heroku. With support for the most popular languages such as Ruby and Node.js, high-scale data services including Postgres, Redis and Kafka, and an add-ons ecosystem featuring over 150 cloud application services, Heroku provides companies from startups to Fortune 500 enterprises with a faster and more effective way to create, deploy and manage beautiful apps in the cloud."
      }
    ],

    "gold": [
	{
	    "name": "VividCortex",
	    "logo": "vc-logo-horizontal_071115.png",
	    "largelogo": "vc-logo-horizontal_071115.png",
	    "badgelogo": "vc-logo-horizontal_071115.png",
	    "link": "https://www.vividcortex.com/",
	    "intro": "VividCortex is the best way to improve your database performance, efficiency, and uptime. It is a secure, cloud-hosted platform that eliminates your most critical visibility gap, providing deep insights into production database workload and query performance. It measures the performance and resource consumption of every statement and transaction, then uses patented algorithms to analyze and surface relevant insights, so you can proactively fix future performance problems before they impact customers. To learn more, visit <a href=\"http://www.vividcortex.com\">www.vividcortex.com</a> or follow us on Twitter @VividCortex."
	},
	{
	    "name": "Amazon Web Services",
	    "logo": "amazon-web-services.gif",
	    "largelogo": "amazon-web-services.gif",
	    "badgelogo": "amazon-web-services.gif",
	    "link": "https://aws.amazon.com/",
	    "intro": "Amazon Web Services"
	},
	{
	    "name": "Datadog",
	    "logo": "dd_logo_v_cmyk.png",
	    "largelogo": "dd_logo_v_cmyk.png",
	    "badgelogo": "dd_logo_v_cmyk.png",
	    "link": "https://www.datadoghq.com/",
	    "intro": "Datadog is a SaaS-based monitoring and analytics platform for large-scale applications and infrastructure. Combining real-time metrics from servers, containers, databases, and applications with end-to-end tracing, Datadog delivers actionable alerts and powerful visualizations to provide full-stack observability. Datadog includes over 200 vendor-supported integrations and APM libraries for several languages."
	},
  {
    "name": "Enterprise DB",
    "logo": "edb_logo.png",
    "largelogo": "edb_logo.png",
    "badgelogo": "edb_logo.png",
    "link": "https://www.edbpostgres.com/",
    "intro": "EnterpriseDB® (EDB™), the database platform company for digital business, delivers the premier open source-based data platform for new applications, cloud re-platforming, application modernization, and legacy migration. EnterpriseDB integrates with enterprise technologies and infrastructures for hybrid cloud management, data integration, and data warehousing. Our customers benefit from the most reliable, high-performing, flexible, open, and cost-effective data management platform available. EnterpriseDB is based in Bedford, Massachusetts with offices around the globe. For more information, visit www.EDBPostgres.com."
  },
  {
      "name": "Crunchy Data",
      "logo": "crunchy_data.png",
      "largelogo": "crunchy_data.png",
      "badgelogo": "crunchy_data.png",
      "link": "https://www.crunchydata.com/",
      "intro": "Crunchy Data is a leading provider of trusted open source PostgreSQL and enterprise PostgreSQL technology, support and training.  Crunchy Data offers Crunchy Certified PostgreSQL, the most advanced pure open source RDBMS on the market and the first open source RDBMS to achieve Common Criteria certification. Crunchy Data is a leading provider of Cloud Native PostgreSQL – providing open source, cloud agnostic PostgreSQL-as-a-Service solutions. PostgreSQL’s active development community, proven architecture and reputation for reliability, data integrity, and ease of use make it a prime candidate for enterprises looking for a robust relational database alternative to expensive proprietary database technologies."
  }
    ],

    "silver": [
	{
	    "name": "Cybertec",
	    "logo": "Cybertec_Logo_2017_1024px_slogan.jpg",
	    "largelogo": "Cybertec_Logo_2017_1024px_slogan.jpg",
	    "badgelogo": "Cybertec_Logo_2017_1024px_slogan.jpg",
	    "link": "https://www.cybertec.at/",
	    "intro": "Cybertec"
	},
	{
	    "name": "data egret",
	    "logo": "DE_logo_horizontal.png",
	    "largelogo": "DE_logo_horizontal.png",
	    "badgelogo": "DE_logo_horizontal.png",
	    "link": "http://dataegret.com/",
	    "intro": "data egret"
	},
  {
      "name": "opentable",
      "logo": "opentable.png",
      "largelogo": "opentable.svg",
      "badgelogo": "opentable.eps",
      "link": "https://www.opentable.com/start/home",
      "intro": "opentable"
  }
    ],

    "supporter": [
	{
	    "name": "JackDB",
	    "logo": "jackdb-logomark-700x200.png",
	    "largelogo": "jackdb-logomark-700x200.png",
	    "badgelogo": "jackdb-logomark-700x200.png",
	    "link": "https://www.jackdb.com/",
	    "intro": "JackDB"
	},
	{
	    "name": "PostgreSQL Experts",
	    "logo": "pg_exp.png",
	    "largelogo": "pg_exp.png",
	    "badgelogo": "pg_exp.png",
	    "link": "https://www.pgexperts.com/",
	    "intro": "PostgreSQL Experts"
	},
	{
	    "name": "Pandora",
	    "logo": "Pandora_Wordmark_RGB.png",
	    "largelogo": "Pandora_Wordmark_RGB.png",
	    "badgelogo": "Pandora_Wordmark_RGB.png",
	    "link": "https://www.pandora.com/",
	    "intro": "Pandora"
	},
	{
	    "name": "Google",
	    "logo": "google.png",
	    "largelogo": "google.png",
	    "badgelogo": "google.png",
	    "link": "https://cloud.google.com",
	    "intro": "Google Cloud Platform"
	}  
    ],
    "partner": [
      {
        "name": "PostgreSQL US",
        "logo": "pgus.png",
        "largelogo": "pgus.png",
        "badgelogo": "pgus.png",
        "link": "https://postgresql.us/associatedprojects/",
        "intro": "PostgreSQL US"
      },
      {
        "name": "Foss4G",
        "logo": "foss4g.png",
        "largelogo": "foss4g.png",
        "badgelogo": "foss4g.png",
        "link": "http://2017.foss4g.org/community-partner/",
        "intro": "Foss4G"
      }
    ],
	"blogposts": [
    {
    "title": "An interview with Microsoft: Adding Postgres to Azure and joining the Postgres community",
    "sponsorname": "PostgresOpen",
    "posttime": "2017-09-06",
      "content":"As our conference kicks off tomorrow we're looking forward to all the great talks and conversation about all things Postrges. To wet your appetite we took the chance to sit down with another of our Diamond sponsors Microsoft, who recently added support for Postgres to Azure. Give a read to how they approach Postgres and the community.<br/><br/><b>PostgresOpen SV:</b> Microsoft has long been known for SQL server, but recently added PostgreSQL to the ranks for Azure. Can you tell us a little more on the background of how PostgreSQL came to be part of the ranks for Azure?<br/><br/><b>Rohan Kumar:</b>Microsoft’s mission is to enable every person and every organization on the planet to achieve more. To make this mission meaningful for our customers, we intend to meet them where they are, helping them to be productive with the technologies and tools of their choice. PostgreSQL has a strong community and is one of the most loved open source databases, bringing industry leading innovations to customers. As we move towards offering customers more choice, bringing PostgreSQL as a fully managed service on Azure was a natural step for us.<br/><br/><b>PostgresOpen SV:</b>Microsoft has made a lot more commitments to open source in recent years. PostgreSQL of course has a long history as an open source database, how do you see Microsoft contributing and engaging with that community in the future?<br/><br/><b>Rohan Kumar:</b> We are excited to be working with PostgreSQL community. We would love to partner with the community to bring our experience, from building SQL Server over the years, to PostgreSQL – and to learn in areas where PostgreSQL excels. We have already engaged on pgsql-hackers mailing list and working with the community on patches. Moving forward, we will continue to contribute back and partner with the community in the service of our customers. As we look forward, the possibilities of what we can work together on are amazing.<br/><br/><b>PostgresOpen SV:</b> While PostgreSQL is newer to Microsoft, databases are certainly not new having a long history with SQL Server which is also a very solid database. How do you expect all of your learnings over the years with SQL Server to apply and support PostgreSQL?<br/><br/><b>Rohan Kumar:</b> As mentioned above, we would love to share our learnings from working on SQL Server with the PostgreSQL community. While there are many areas that we can work on together with the community, a couple of areas to highlight would be connectivity for the cloud and making PostgreSQL more robust and compatible in Windows development environment.<br/><br/><b>PostgresOpen SV:</b> For those looking to get started with PostgreSQL on Azure, where should they start?<br/><br/><b>Rohan Kumar:</b> The best way to get started with Azure Database for PostgreSQL is to visit our <a href=\"https://docs.microsoft.com/en-us/azure/postgresql/\">documentation page</a> where you can find 5-minute quickstarts, step-by-step tutorials and samples. If you are ready to go, you can start using the $200 free credit when you create a <a href=\"https://azure.microsoft.com/en-us/free/\">free account with Azure.</a><br/><br/>"
    },
    "title": "An interview with 2ndQuadrant: whats new and whats coming in Postgres",
    "sponsorname": "PostgresOpen",
    "posttime": "2017-08-31",
      "content":"Continuing in down our list of some of the great sponsors we get to sit down and talk to today we jump in with Simon Riggs of 2ndQuadrant.<br/<br/><b>PostgresOpen SV:</b><a href=\"https://www.2ndquadrant.com/en/\">2ndQuadrant</a> works both with a bunch of US clients as well as contributing to much of Postgres and the ecosystem around it. How does the mix of contributing to core Postgres as well as direct client interaction help improve Postgres overall?<br/><br/><b>Simon Riggs: </b>2ndQuadrant is a major developer of open source PostgreSQL, contributing both major new features and bug fixes regularly. We use our direct client interactions to focus these contributions so we can prioritise the biggest issues for our clients. With over 15 years of customer engagements we have been able to identify bottlenecks and then contribute towards enterprise features that fix them in PostgreSQL, benefiting everyone that uses it. <b>PostgresOpen SV:</b> Postgres 10 is just around the corner, 2ndQuadrant have many developers that contributed to it. Can you share a bit on what you're most excited about in Postgres 10?<br/><br/><b>Simon Riggs: </b>It’s the Big One - the release where we finally get logical replication into core!<br/><br/>2ndQuadrant has supported BDR and <a href=\"https://github.com/2ndQuadrant/pglogical\">pglogical</a> for some years now, though we now have some very important aspects of that added to core PostgreSQL. The new logical replication uses two new commands: PUBLICATION and SUBSCRIPTION to allow users to define flows of changed data from one server to another.<br/><br/>This work has taken many years of effort to bring to the current level, resulting from many 2ndQuadrant developers and various reviewers and testers. It opens up many possible use-cases with this important new replication technology.<b>PostgresOpen SV:</b>Because of you are an active participant in the community you have a good idea for where the project is headed beyond Postgres 10... What’s the future look like?<br/><br/><b>Simon Riggs:</b> Very good! Spoiler alert - we win!<br/><br/>Open source PostgreSQL has been growing year on year and we’re attracting interest from the largest enterprises now. There are still some large predators out there but the community is big enough and strong enough to push forwards.<br/><br/>Technically we continue to tune, innovate and evolve. Expect to see many further performance features, new ways of developing and ease of use features - whatever customers need to succeed with PostgreSQL.<br/><br/>From 2ndQuadrant you can expect some big new developments around Bi Directional Replication (BDR), though we also have things brewing around Postgres-XL 10, Barman, repmgr 4, pglogical 3 and pgbouncer as well as other existing projects.<br/><br/> Recent developments include the release of OmniDB, a new web-based admin tool for both PostgreSQL and other DBMS, specially designed around rapid response and ease of use.<br/><br/>We have pursued a joint strategy of providing both working code (available now) and later submitting the features into core PostgreSQL. Postgres-BDR is an open source project from 2ndQuadrant that provides multi-master replication for PostgreSQL. One of the greatest achievements to come out of our work on BDR is the logical replication technology that will be available in PostgreSQL 10, as I previously mentioned. We will be submitting further enhancements of performance and robustness into later releases of PostgreSQL. You can read more about the Postgres-BDR roadmap <a href=\"https://blog.2ndquadrant.com/news-and-roadmap-for-bdr-multi-master-postgresql/\">here</a>.<br/><br/><b>PostgresOpen SV:</b> What are you doing about cloud?<br/><br/><b>Simon Riggs: </b>We’ve been encouraging cloud usage for many years now with contributions such as energy saving low-power mode, EXTENSIONs, database block checksums, group commit and a slew of backup and replication features all specifically aimed at cloud usage. <br/><br/>We’re happy that various cloud vendors have been using PostgreSQL in the cloud for many years now and we believe it’s important for users to have both choice and quality.<br/><br/>2ndQuadrant has offered consulting services and support to customers using cloud services for many years. 2ndQuadrant offers the Trusted PostgreSQL Architecture (TPA) tool to orchestrate and deploy database services for on-premise, public or hybrid clouds. 2ndQuadrant uses TPA to offer Managed and Supported DBaaS to customers, particularly around Postgres-BDR and Postgres-XL, as well as standard Postgres.<br/><br/><b>PostgresOpen SV:</b>Do you see a lot of people moving to PostgreSQL from other databases? If yes, how do you help them with the migration process?<br/><br/><b>Simon Riggs: </b>PostgreSQL is the most popular database when it comes to new adoption. Even existing users of other databases are flocking towards PostgreSQL - and it’s not just to save money. PostgreSQL is fully capable of securely supporting enterprise database systems. <br/><br/>We have developed specialized tools to facilitate migrations from Oracle and other database management systems.  Our team not only consists of the largest collective of PostgreSQL experts globally, they also have a deep knowledge of other DBMS such as Oracle and MySQL.<br/><br/>2ndQuadrant believes in promoting open source PostgreSQL as a solution that is trusted globally by large and small businesses in various industry verticals, highlighting that it's developed by a vibrant community focused on making it more powerful with every release. Using PostgreSQL allows users to break free from vendor lock-in and design a database that is customized for their business needs, something that any company would benefit from."
    },
    {
    "title": "Announcing Keynote Guest: Paul Vixie to PostgresOpen SV",
    "sponsorname": "PostgresOpen",
    "posttime": "2017-08-25",
      "content":"We are thrilled to announce that <a href=\"https://en.wikipedia.org/wiki/Paul_Vixie\">Dr. Paul Vixie</a>, CEO of Farsight Security, Internet Hall of Fame Innovator, and one of the primary individuals responsible for the one of the largest, most distributed and used databases in the world, the Domain Name System (DNS), will be our Guest Keynote speaker this year! <br/><br/>Paul helped create one of the most important databases in the world: DNS, a key backbone technology for the ongoing operation of the Internet and he brings an interesting perspective on both data and open source. We're excited to hear from Paul and learn from his insights in addition to our other keynote speakers from: <a href=\"http://www.2ndquadrant.com\">2ndQuadrant</a>, <a href=\"https://www.citusdata.com\">Citus Data</a>, and <a href=\"https://azure.microsoft.com/en-us/services/postgresql/\">Microsoft</a>. <br/><br/>If you're still thinking of joining us there make sure to grab one of the few <a href=\"https://2017.postgresopen.org/tickets/\">remaining tickets</a> before they're sold out."
    },
    {
    "title": "An interview with Heroku on Postgres",
    "sponsorname": "PostgresOpen",
    "posttime": "2017-08-22",
      "content":"We got the chance to sit down with <a href=\"https://twitter.com/neovintage\">Rimas Silkaitis</a> from the <a href=\"https://www.heroku.com/postgres\">Heroku Data team</a> and dig into some of the history behind their choosing and becoming the first database as a service provider and how the see things evolving.<br/><br/><b>PostgresOpen SV:</b> Heroku Postgres helped drive much of the resurgence of Postgres, why do feel it was often overlooked several years ago? <br/><br/><b>Rimas:</b> It depends on where it was being overlooked and the time frame. If we're talking about Heroku's sweet spot, building web applications, 10 or more years ago, then Postgres was definitely overlooked. Postgres took the approach of focusing on security, being standards-compliant and having a robust feature set. Other databases at the time, focused on ease of use. For many developers looking to build web applications, and for many for the very first time, ease of use was paramount. Because of the approach the community took on Postgres, it provided fewer opportunities for developers to shoot themselves in the foot as their application grew. <br/><br/><b>PostgresOpen SV:</b> You've been running a database as a service for some years now, in fact you were one of the first to run Postgres as a service, how have you seen managed database services change?<br/><br/><b>Rimas: </b>When Heroku Postgres started being able to run Postgres as a service or any database for that matter was no small feat. That was the value of the service. Over time what we've seen is that getting the database service running is the minimum bar. Any DBaaS needs to go beyond just providing the service and do more for the customer. This means providing more features and functionality around operating the database that may not be inherently built into the database itself. For example, Heroku Postgres has commands and functions that will diagnose potential problems with the database called <a href=\"https://blog.heroku.com/pg-diagnose\">PGDiagnose</a>. It's those kinds of features that developers are really looking for so that they don't have to worry about the database.<br/><br/><b>PostgresOpen SV: </b>For most people trusting you with their data is a big decision, what are they able from a database as a service that they couldn't achieve otherwise.<br/><br/><b>Rimas: </b>I'm a bit biased because I lead Heroku Postgres but using a DBaaS should be a no-brainer. So much goes into running a database effectively that if you want to do it on your own you're going to need so much infrastructure to pull it off. That's just the fixed costs. What about the people power needed to keep that database running? But the real value for anyone using a DBaaS is not all of the features and processes that comes from buying that product but that time that you and your team gets by focusing on the areas that matter to the business. Will you make money by building your own infrastructure to support a high-availability setup or does it come from time your team takes to build the application that actually generates revenue? The really good DBaaS providers will make sure that they give you and your company the confidence that your <a href=\"https://blog.heroku.com/postgres-configuration-credentials-ci\">data is secure</a> by providing all of the necessary transparency and data portability. This way you can be confident that you are in control. <br/><br/><b>PostgresOpen SV: </b>What are you most excited for about the direction of Postgres and its future?<br/><br/><b>Rimas: </b>We're really excited about the work being done around partitioning. In postgres 10, the community is making it easier to use and making it part of the database itself. While table partitioning does not get Postgres in the distributed system realm, it does point to a future where Postgres could get there. Companies like <a href=\"https://www.citusdata.com\">Citus</a> and projects like TimescaleDB are already showing us that it's possible. Postgres will become *the* database choice to handle all sorts of applications and their use cases, it's only a matter of time."
    },
    {
    "title": "PostgresOpen SV Schedule Live",
    "sponsorname": "PostgresOpen",
    "posttime": "2017-08-08",
        "content": "PostgresOpen Silicon Valley this year is the exciting combination of PostgresOpen and PGConf Silicon Valley. The conference is coming up right in downtown San Francisco, September 6th to 8th! Our schedule is live and we thought we could take a look at a few of the highlights. Feel free to take a <a href=\"https://postgresql.us/events/schedule/pgopen2017/\">look yourself</a> and get your <a href=\"https://2017.postgresopen.org/tickets/\">ticket</a> and <a href=\"https://aws.passkey.com/e/49007744\">room</a> while they're still available.<br/><br/>This year the schedule boasts talks from a number of Postgres contributors such as:<ul><li>Magnus Hagander taking a look at <a href=\"https://2017.postgresopen.org/tickets/\">Postgres 10</a></li><li>Bruce Momjian teaching us about <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/364-postgres-window-magic/\">Window Functions</a></li><li>Andres Freund examining <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/445-improving-postgres-efficiency/\">Postgres efficiency improvements</a></li></ul>We also have a number of talks that start to explore some of the new fronts of Postgres, from security to using it as a distributed platform such as:<ul><li>Joe Conway looking at <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/415-securing-postgresql-exploring-the-postgresql-stig-and-beyond/\">the PostgreSQL STIG</a></li><li>Marco Slot looking at <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/409-postgresql-as-a-distributed-computing-platform/\">Postgres as a distributed computing platform</a></li><li>Robert Treat highlighting whats available with <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/447-logical-replication-live/\">logical replication</a></li></ul>And last but not least we have a number of presenters from notable companies sharing how they've run Postgres at scale.<ul><li>Andrew Kane from Instacart looks at how <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/399-how-postgres-could-index-itself/\">Postgres could index itself</a></li><li>Jesse Willett of Prosperworks walks through how they <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/376-scaling-a-saas-application-beyond-a-single-postgres-with-citus/\">scaled beyond a single node by sharding with Citus</a></li><li>Stephen Rees from Pandora shares <a href=\"https://postgresql.us/events/schedule/pgopen2017/session/377-postgresql-at-pandora/\">how they run Postgres</a></li></ul><br/>Rooms are available only for a few more days so make sure to grab your reservation now and we look forward to seeing you there."
    },
    {
		"title": "Early Bird Registration Opens!",
		"sponsorname": "PostgresOpen",
		"posttime": "2017-05-15",
        "content": "Early Bird Registration for PostgresOpen SV 2017, being held in beautiful downtown San Francisco from September 6th to 8th, is now open!  PostgresOpen and PGConf SV have joined forces this year to put on this fantastic conference in downtown San Francisco.<br><br>Simply go to: <a href=\"https://2017.postgresopen.org/tickets/\">our tickets page</a> and register to attend the longest running annual PostgreSQL conference in the US.<br><br>The Program Committee is excited to be able to offer tickets for PostgresOpen at the same rate as last year, with a $200 discount for early bird registrations!<br><br>We also want to remind you that the Call for Papers is only open until May 30th, Anywhere on Earth (AoE), this is the last chance for you to <a href=\"https://2017.postgresopen.org/callforpapers/\">submit your talk</a> for PostgresOpen SV 2017, there's only two weeks left!<br><br>Presentations on any topic related to PostgreSQL including, but not limited to, case studies, experiences, tools and utilities, application development, data science, migration stories, existing features, new feature development, benchmarks, and performance tuning are encouraged.<br><br>Tutorials will be announced in the coming weeks- watch our <a href=\"https://2017.postgresopen.org/blog/\">blog</a> for updates!<br><br>The Program Committee looks forward to bringing the best PostgreSQL presentations and tutorials from speakers around the world the fantastic Parc55 in downtown San Francisco.<br><br>Speakers will be notified by June 6th, 2017 AoE, with the schedule to be published once selected speakers have confirmed.<br><br>PostgresOpen SV 2017 is only able to happen with the support of our fantastic sponsors.  We are extremely pleased to be able to recognize our Diamond launch sponsors: <a href=\"https://www.2ndquadrant.com\">2ndQuadrant</a> and <a href=\"https://www.citusdata.com/\">CitusData</a> and head to our site to see all of our Gold, Silver and Supporter sponsors on <a href=\"https://2017.postgresopen.org/sponsors/\">our sponsors page</a>.<br><br> Sponsorship opportunities are still available!  Please visit <a href=\"https://2017.postgresopen.org/becomesponsor/\">sponsorship campaign page</a> to review our prospectus.<br><br>We look forward to seeing everyone in San Francisco!"
    },
	{
		"title": "Call For Papers",
		"sponsorname": "PostgresOpen",
		"posttime": "2017-03-24",
		"content": "The Call For Papers for PostgresOpen SV 2017 is now open!<br><br>PostgresOpen and PGConf SV have joined forces this year to put on a fantastic conference taking place in downtown San Francisco from September 6th to 8th.<br><br>If you are working with PostgreSQL, please <a href=\"https://2017.postgresopen.org/callforpapers/\"> submit a talk!</a><br><br>Presentations can be on any topic related to <a href=\"https://postgresql.org\">PostgreSQL</a>, including, but not limited to, case studies, experiences, tools and utilities, migration stories, existing features, new feature development, benchmarks, performance tuning, and more!<br><br>The 2017 PostgresOpen Committee looks forward to bringing the best PostgreSQL presentations and tutorials from speakers around the world to San Francisco!<br>We're only able to do that with support from our great sponsors!<br>We are extremely pleased to announce our Diamond launch sponsors for PostgresOpen 2017: <a href=\"https://www.2ndquadrant.com/\">2ndQuadrant</a> and <a href=\"https://www.citusdata.com/\">CitusData</a> and our Gold sponsors, VividCortex and Amazon Web Services!<br><br>Keep an eye on <a href=\"https://2017.postgresopen.org/sponsors/\">our sponsors page</a> for updates.<br><br>If you are interested in sponsoring, please visit our <a href=\"https://2017.postgresopen.org/becomesponsor/\"> sponsoring campaign.</a><br><br>PostgresOpen is an Associated Project of the <a href=\"https://postgresql.us\">United States PostgreSQL Assocation (PgUS)</a>! Without PgUS, we would not be able to run these conferences each year, nor support the many PUGs around the country, so please visit <a href=\"https://postgresql.us\">them</a> and consider becoming a member to help promote the growth and education of <a href=\"https://postgresql.org\">PostgreSQL</a> in the US!<br><br>Anyone and everyone in the PostgreSQL community is encouraged to submit a talk.<br><br>Talks will be accepted up until May 29th, Anywhere on Earth (AoE), also known as: 2017-05-29 23:59:59-12:00.<br><br>To see when this is in your timezone, simply use PostgreSQL:<br><br> => set timezone = 'US/Eastern'; -- Change to yours!<br>SET<br>=> select '2017-05-29 23:59:59-12:00'::timestamptz;<br>timestamptz<br>-------------------<br>2017-05-30 07:59:59-04<br><br>Speakers will be notified by June 5th, 2017 AoE, with the schedule to be published once selected speakers have confirmed.<br>Early Bird registration for PostgresOpen 2017 will open on May 15th!"
     }
     ],

    "tracks": [
    {
      "color": "#859900",
      "incfp": true,
      "trackname": "PostgresOpen 2017",
      "sortkey": 100
    },
    {
      "color": "#FFFFEE",
      "incfp": false,
      "trackname": "Breaks",
      "sortkey": 120
    }
    ],

    "days": [
    {
      "schedule_height": 872.0,
      "schedule_width": 600,
      "day": "2017-03-21",
      "rooms": [
        {
          "heightpos": 28,
          "name": "Drottningholm",
          "sessions": [
            {
              "leftpos": 0,
              "heightpos": 43.0,
              "length": 30.0,
              "room": null,
              "title": "Registration",
              "track": {
                "color": "#FFFFEE",
                "incfp": false,
                "trackname": "Breaks",
                "sortkey": 120
              },
              "cross_schedule": true,
              "timeslot": "08:30 - 09:00",
              "widthpos": 598,
              "toppos": 30.0
            },
            {
              "leftpos": 0,
              "heightpos": 20.5,
              "length": 15.0,
              "room": null,
              "title": "Welcome and Opening",
              "track": {
                "color": "#FFFFEE",
                "incfp": false,
                "trackname": "Breaks",
                "sortkey": 120
              },
              "cross_schedule": true,
              "timeslot": "09:00 - 09:15",
              "widthpos": 598,
              "toppos": 75.0
            },
            {
              "track": {
                "color": "#859900",
                "incfp": true,
                "trackname": "PostgresOpen 2017",
                "sortkey": 100
              },
              "id": 1458,
              "toppos": 97.5,
              "heightpos": 75.0,
              "speakers": [
                {
                  "lastmodified": "2016-12-22T08:43:39.872159",
                  "fullname": "Speaker 1",
                  "company": "Company 1",
                  "abstract": "Speaker Abstract Number 1.",
                  "twittername": ""
                }
              ],
              "room": {
                "roomname": "Room 1",
                "sortkey": 100
              },
              "title": "Talk Number 1",
              "leftpos": 0,
              "length": 50.0,
              "timeslot": "09:15 - 10:05",
              "widthpos": 598
            },
            {
              "leftpos": 0,
              "heightpos": 35.5,
              "length": 25.0,
              "room": null,
              "title": "Coffee",
              "track": {
                "color": "#FFFFEE",
                "incfp": false,
                "trackname": "Breaks",
                "sortkey": 120
              },
              "cross_schedule": true,
              "timeslot": "10:05 - 10:30",
              "widthpos": 598,
              "toppos": 172.5
            },
            {
              "track": {
                "color": "#859900",
                "incfp": true,
                "trackname": "PostgresOpen 2017",
                "sortkey": 100
              },
              "id": 1501,
              "toppos": 210.0,
              "heightpos": 75.0,
              "speakers": [
                {
                  "lastmodified": "2015-08-17T18:04:24.018834",
                  "fullname": "Speaker 2",
                  "company": "Company 2",
                  "abstract": "Speaker Abstract Number 2.",
                  "twittername": ""
                }
              ],
              "room": {
                "roomname": "Room 1",
                "sortkey": 100
              },
              "title": "Talk Number 2",
              "leftpos": 0,
              "length": 50.0,
              "timeslot": "10:30 - 11:20",
              "widthpos": 598
            }
          ],
          "leftpos": 0,
          "widthpos": 598,
          "id": 70
        }
      ],
      "sessions": [
        {
          "leftpos": 0,
          "heightpos": 43.0,
          "length": 30.0,
          "room": null,
          "title": "Registration",
          "track": {
            "color": "#FFFFEE",
            "incfp": false,
            "trackname": "Breaks",
            "sortkey": 120
          },
          "cross_schedule": true,
          "timeslot": "08:30 - 09:00",
          "widthpos": 598,
          "toppos": 30.0
        },
        {
          "leftpos": 0,
          "heightpos": 20.5,
          "length": 15.0,
          "room": null,
          "title": "Welcome and Opening",
          "track": {
            "color": "#FFFFEE",
            "incfp": false,
            "trackname": "Breaks",
            "sortkey": 120
          },
          "cross_schedule": true,
          "timeslot": "09:00 - 09:15",
          "widthpos": 598,
          "toppos": 75.0
        },
        {
          "track": {
            "color": "#859900",
            "incfp": true,
            "trackname": "PostgresOpen 2017",
            "sortkey": 100
          },
          "id": 1458,
          "toppos": 97.5,
          "heightpos": 75.0,
          "speakers": [
            {
              "lastmodified": "2016-12-22T08:43:39.872159",
              "fullname": "Speaker 1",
              "company": "Company 1",
              "abstract": "Speaker Abstract Number 1.",
              "twittername": ""
            }
          ],
          "room": {
            "roomname": "Room 1",
            "sortkey": 100
          },
          "title": "Talk Number 1",
          "leftpos": 0,
          "length": 50.0,
          "timeslot": "09:15 - 10:05",
          "widthpos": 598
        },
        {
          "leftpos": 0,
          "heightpos": 35.5,
          "length": 25.0,
          "room": null,
          "title": "Coffee",
          "track": {
            "color": "#FFFFEE",
            "incfp": false,
            "trackname": "Breaks",
            "sortkey": 120
          },
          "cross_schedule": true,
          "timeslot": "10:05 - 10:30",
          "widthpos": 598,
          "toppos": 172.5
        },
        {
          "track": {
            "color": "#859900",
            "incfp": true,
            "trackname": "PostgresOpen 2017",
            "sortkey": 100
          },
          "id": 1501,
          "toppos": 210.0,
          "heightpos": 75.0,
          "speakers": [
            {
              "lastmodified": "2015-08-17T18:04:24.018834",
              "fullname": "Speaker 2",
              "company": "Company 2",
              "abstract": "Speaker Abstract Number 2.",
              "twittername": ""
            }
          ],
          "room": {
            "roomname": "Room 1",
            "sortkey": 100
          },
          "title": "Talk Number 2",
          "leftpos": 0,
          "length": 50.0,
          "timeslot": "10:30 - 11:20",
          "widthpos": 598
        }
      ]
    }
  ]
}
